src/Documents/СведенияОДвиженииРаботниковДПУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>СведенияОДвиженииРаботниковДПУ</Name>
			<Comment>(Регл)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АрхивДанныхРегламентированнойОтчетности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВклДогПодряда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделенияИскл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаботникиОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресРегистрации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>240</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Телефоны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>240</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фамилия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отчество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пол</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПолФизическихЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоРождения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>120</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гражданство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексРегистрации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>6</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГородРождения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>28</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РайонРождения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>28</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбластьРождения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>28</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПаспортСерия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПаспортНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПаспортКемВыдан</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>56</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПаспортДатавыдачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛичныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаРождения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПриема</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУвольнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УвольнениеИзОрганизаций</v8:Type>
								<v8:Type>cfg:DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВнешнееСовместительство</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПодразделений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИсключаемоеПодразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ГражданствоФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГражданствоФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИмеетПравоНаПенсию</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеЯвляетсяНалоговымРезидентомРФ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ФИОФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SurName</Name>
					<Comment>//+ СВЭЙ КДЯ СВФР-004525  15.07.19</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>GivenNames</Name>
					<Comment>//+ СВЭЙ КДЯ СВФР-004525  15.07.19</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ПричиныИзмененияСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПричиныИзмененияСостояния</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыДоговоровСФизЛицами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровСФизЛицами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контракт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрудовойДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подряда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Авторский</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорУправленческий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/СведенияОДвиженииРаботниковДПУ/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
// Выполняет автоматическое заполнение документа по данным документа и переданным параметрам
// 
// Параметры: 
//  нет
//
// Возвращаемое значение:
//  Логическое - удалось ли выполнить автоматическое заполнение документа
//
Функция Автозаполнение(ПостроительЗапроса = Неопределено) Экспорт
	
	СписокПустыхНомеровПФР = Новый СписокЗначений;
	//толик сделал брать пустые номера
	//СписокПустыхНомеровПФР.Добавить("");
	//СписокПустыхНомеровПФР.Добавить("              ");
	//исзенил запрос без учета кадровых перемещений
	СписокПустыхНомеровПФР.Добавить("Ч");
	//
	
	СписокПричин = Новый СписокЗначений;
	СписокПричин.Добавить(Перечисления.ПричиныИзмененияСостояния.Увольнение);
	СписокПричин.Добавить(Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу);
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",                ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("Организация",                Организация);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("СписокПустыхНомеровПФР",        СписокПустыхНомеровПФР);
	Запрос.УстановитьПараметр("Увольнение",        СписокПричин);
	Запрос.УстановитьПараметр("ДатаНачала" ,         НачалоКвартала(ДатаРегистрации));
	//толик увольнение дата + 1 день                
	Запрос.УстановитьПараметр("ДатаАктуальности" ,     КонецКвартала(ДатаРегистрации));
	Запрос.УстановитьПараметр("ВидАдресаРегистрации" ,     Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица);
	Запрос.УстановитьПараметр("ВидАдресаФактический" ,     Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица);
	Запрос.УстановитьПараметр("ВидТелефонаДомашний" ,     Справочники.ВидыКонтактнойИнформации.ТелефонФизЛица);
	Запрос.УстановитьПараметр("ТипТелефон" ,     Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ТипАдрес" ,     Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("ПустаяСтрана" , Справочники.КлассификаторСтранМира.ПустаяСсылка());
	Запрос.УстановитьПараметр("СтранапоУмолчанию" , Справочники.КлассификаторСтранМира.НайтиПоКоду("112"));
	//Аверсон-софт, Островская Татьяна 20.06.2012 № 15516
	Запрос.УстановитьПараметр("ВидДоговора" , Перечисления.ВидыДоговоровСФизЛицами.Подряда);
	
	СписокПодразделений = ТаблицаПодразделений.ВыгрузитьКолонку("ИсключаемоеПодразделение");
	Запрос.УстановитьПараметр("СписокПодразделений" , СписокПодразделений);
	Запрос.УстановитьПараметр("ВыбранноеПодразделение" , ПодразделениеОрганизации);	 //Аверсон 09.09.2019 КВВ СВФР-004742
	
	если не НеВклДогПодряда тогда 
		//Аверсон-софт, Островская Татьяна 20.06.2012 № 15516
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|    ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
		|    ФИОФизЛицСрезПоследних.Имя КАК Имя,
		|    ФИОФизЛицСрезПоследних.Отчество КАК Отчество,
		|    АдресаРегистрации.Поле1 КАК ИндексРегистрации,
		|    АдресаРегистрации.Поле2 + "","" + АдресаРегистрации.Поле3 + "","" + АдресаРегистрации.Поле4 + "","" + АдресаРегистрации.Поле5 + "","" + АдресаРегистрации.Поле6 + "","" + АдресаРегистрации.Поле7 + "","" + АдресаРегистрации.Поле8 + "","" + АдресаРегистрации.Поле9 КАК АдресРегистрации,
		|    ДомашниеТелефоны.Поле3 КАК Телефоны,
		|    ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК ПаспортСерия,
		|    ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК ПаспортНомер,
		|    ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ПаспортДатаВыдачи,
		|    ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ПаспортКемВыдан,
		|    СписокФизлиц.Регистратор КАК Документ,
		|    СписокФизлиц.ФизЛицо,
		|    СписокФизлиц.ФизЛицо.Пол КАК Пол,
		|    СписокФизлиц.ФизЛицо.ДатаРождения КАК ДатаРождения,
		|    СписокФизлиц.ФизЛицо.СтраховойНомерПФР КАК ЛичныйНомер,
		|    СписокФизлиц.ФизЛицо.МестоРождения КАК МестоРождения,
		|    ВЫБОР
		|        КОГДА ГражданствоФизЛиц.ФизЛицо ЕСТЬ NULL 
		|                ИЛИ ГражданствоФизЛиц.Страна = &ПустаяСтрана
		|            ТОГДА &СтранаПоУмолчанию
		|        ИНАЧЕ ГражданствоФизЛиц.Страна
		|    КОНЕЦ КАК Гражданство,
		|    СписокФизлиц.Период КАК Период,
		|    ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо.СтатусКатегория.КодПФР КАК КодФСЗН,
		|	 Выбор когда СписокФизлиц.ВидЗанятости = Значение(Перечисление.ВидыЗанятостиВОрганизации.Совместительство) тогда 1 иначе 0 конец как ВнешнееСовместительство
		|ИЗ
		|    (ВЫБРАТЬ
		|        РаботникиОрганизаций.Сотрудник.Физлицо КАК ФизЛицо,
		|        РаботникиОрганизаций.Регистратор КАК Регистратор,
		|        РаботникиОрганизаций.Период КАК Период,
		|        ВЫБОР
		|            КОГДА РаботникиОрганизаций.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|                ТОГДА 0
		|            ИНАЧЕ 1
		|        КОНЕЦ КАК Сортировка,
		|		РаботникиОрганизаций.Сотрудник.ВидЗанятости КАК ВидЗанятости

		|    ИЗ
		|        РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|    ГДЕ
		|        РаботникиОрганизаций.ПодразделениеОрганизации.Владелец = &Организация
		|        И (НЕ РаботникиОрганизаций.Сотрудник.Физлицо.СтраховойНомерПФР В (&СписокПустыхНомеровПФР))
		|        И ВЫБОР
		|		КОГДА РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|			ТОГДА РаботникиОрганизаций.Период МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, 1) И ДОБАВИТЬКДАТЕ(&ДатаАктуальности, ДЕНЬ, 1)//О.Т. Аверсон 07.07.2017 № 806
		|		ИНАЧЕ РаботникиОрганизаций.Период МЕЖДУ &ДатаНачала И &ДатаАктуальности
		|		КОНЕЦ
		|        И РаботникиОрганизаций.ПричинаИзмененияСостояния В(&Увольнение)";
		
		//Аверсон 09.09.2019 КВВ СВФР-004742 (
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
			Запрос.Текст = Запрос.Текст + " И РаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ (&ВыбранноеПодразделение)"
		КонецЕсли;
		//Аверсон 09.09.2019 КВВ СВФР-004742 )
		
		Если ТаблицаПодразделений.Количество()>0 Тогда 
			Запрос.Текст = Запрос.Текст + " И не РаботникиОрганизаций.ПодразделениеОрганизации В(&СписокПодразделений)"
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "        
		|    
		|    ОБЪЕДИНИТЬ ВСЕ
		|    
		|    ВЫБРАТЬ
		|        ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо,
		|        ДоговорНаВыполнениеРаботСФизЛицом.Ссылка,
		|        ДоговорНаВыполнениеРаботСФизЛицом.Дата,
		|        0,
		|        ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ВидЗанятости
		|    ИЗ
		|        Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
		|    ГДЕ
		|        (ДоговорНаВыполнениеРаботСФизЛицом.Организация = &Организация
		|                    И (НЕ ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо.СтраховойНомерПФР В (&СписокПустыхНомеровПФР))
		|                    И ДоговорНаВыполнениеРаботСФизЛицом.Проведен
		|                    И ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала >= &ДатаНачала
		|                ИЛИ ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания <= &ДатаАктуальности)";
		
		//Аверсон 09.09.2019 КВВ СВФР-004742 (
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
			Запрос.Текст = Запрос.Текст + " И ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации В ИЕРАРХИИ (&ВыбранноеПодразделение)"
		КонецЕсли;
		//Аверсон 09.09.2019 КВВ СВФР-004742 )
		
		Если ТаблицаПодразделений.Количество()>0 Тогда 
			Запрос.Текст = Запрос.Текст + " И не ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации В(&СписокПодразделений)"
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "		
		|       ) КАК СписокФизлиц
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ГражданствоФизЛиц
		|        ПО СписокФизлиц.ФизЛицо = ГражданствоФизЛиц.ФизЛицо
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ФИОФизЛицСрезПоследних
		|        ПО СписокФизлиц.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
		|        ПО СписокФизлиц.ФизЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ДомашниеТелефоны
		|        ПО СписокФизлиц.ФизЛицо = ДомашниеТелефоны.Объект
		|            И (ДомашниеТелефоны.Вид = &ВидТелефонаДомашний)
		|            И (ДомашниеТелефоны.Тип = &ТипТелефон)
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаФактические
		|        ПО СписокФизлиц.ФизЛицо = АдресаФактические.Объект
		|            И (АдресаФактические.Вид = &ВидАдресаФактический)
		|            И (АдресаФактические.Тип = &ТипАдрес)
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаРегистрации
		|        ПО СписокФизлиц.ФизЛицо = АдресаРегистрации.Объект
		|            И (АдресаРегистрации.Вид = &ВидАдресаРегистрации)
		|            И (АдресаФактические.Тип = &ТипАдрес)
		|
		|УПОРЯДОЧИТЬ ПО
		|    СписокФизлиц.Сортировка,
		|    Период,
		|    Фамилия";
	иначе
		//Аверсон-софт, Островская Татьяна 20.06.2012 № 15516
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
		|	ФИОФизЛицСрезПоследних.Имя КАК Имя,
		|	ФИОФизЛицСрезПоследних.Отчество КАК Отчество,
		|	АдресаРегистрации.Поле1 КАК ИндексРегистрации,
		|	АдресаРегистрации.Поле2 + "","" + АдресаРегистрации.Поле3 + "","" + АдресаРегистрации.Поле4 + "","" + АдресаРегистрации.Поле5 + "","" + АдресаРегистрации.Поле6 + "","" + АдресаРегистрации.Поле7 + "","" + АдресаРегистрации.Поле8 + "","" + АдресаРегистрации.Поле9 КАК АдресРегистрации,
		|	ДомашниеТелефоны.Поле3 КАК Телефоны,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК ПаспортСерия,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК ПаспортНомер,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ПаспортДатаВыдачи,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ПаспортКемВыдан,
		|	СписокФизлиц.Регистратор КАК Документ,
		|	СписокФизлиц.ФизЛицо,
		|	СписокФизлиц.ФизЛицо.Пол КАК Пол,
		|	СписокФизлиц.ФизЛицо.ДатаРождения КАК ДатаРождения,
		|	СписокФизлиц.ФизЛицо.СтраховойНомерПФР КАК ЛичныйНомер,
		|	СписокФизлиц.ФизЛицо.МестоРождения КАК МестоРождения,
		|	ВЫБОР
		|		КОГДА ГражданствоФизЛиц.ФизЛицо ЕСТЬ NULL 
		|				ИЛИ ГражданствоФизЛиц.Страна = &ПустаяСтрана
		|			ТОГДА &СтранаПоУмолчанию
		|		ИНАЧЕ ГражданствоФизЛиц.Страна
		|	КОНЕЦ КАК Гражданство,
		|	СписокФизлиц.Период КАК Период,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо.СтатусКатегория.КодПФР КАК КодФСЗН,
		|	СписокФизлиц.СотрудникВидДоговора,
		|	Выбор когда СписокФизлиц.ВидЗанятости = Значение(Перечисление.ВидыЗанятостиВОрганизации.Совместительство) тогда 1 иначе 0 конец как ВнешнееСовместительство
		|ИЗ
		|	(ВЫБРАТЬ
		|		РаботникиОрганизаций.Сотрудник.Физлицо КАК ФизЛицо,
		|		РаботникиОрганизаций.Регистратор КАК Регистратор,
		|		РаботникиОрганизаций.Период КАК Период,
		|		ВЫБОР
		|			КОГДА РаботникиОрганизаций.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ КАК Сортировка,
		|		РаботникиОрганизаций.Сотрудник.ВидДоговора КАК СотрудникВидДоговора,
		|		РаботникиОрганизаций.Сотрудник.ВидЗанятости КАК ВидЗанятости
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|	ГДЕ
		|		РаботникиОрганизаций.ПодразделениеОрганизации.Владелец = &Организация
		|		И НЕ РаботникиОрганизаций.Сотрудник.Физлицо.СтраховойНомерПФР В (&СписокПустыхНомеровПФР)
		|		И ВЫБОР
		|		КОГДА РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|			ТОГДА РаботникиОрганизаций.Период МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, 1) И ДОБАВИТЬКДАТЕ(&ДатаАктуальности, ДЕНЬ, 1)//О.Т. Аверсон 07.07.2017 № 806
		|		ИНАЧЕ РаботникиОрганизаций.Период МЕЖДУ &ДатаНачала И &ДатаАктуальности
		|		КОНЕЦ
		|		И РаботникиОрганизаций.ПричинаИзмененияСостояния В(&Увольнение)";
		
		//Аверсон 09.09.2019 КВВ СВФР-004742 (
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
			Запрос.Текст = Запрос.Текст + " И РаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ (&ВыбранноеПодразделение)"
		КонецЕсли;
		//Аверсон 09.09.2019 КВВ СВФР-004742 )
		
		Если ТаблицаПодразделений.Количество()>0 Тогда 
			Запрос.Текст = Запрос.Текст + " И не РаботникиОрганизаций.ПодразделениеОрганизации В(&СписокПодразделений)"
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|		И РаботникиОрганизаций.Сотрудник.ВидДоговора <> &ВидДоговора) КАК СписокФизлиц
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ГражданствоФизЛиц
		|		ПО СписокФизлиц.ФизЛицо = ГражданствоФизЛиц.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ФИОФизЛицСрезПоследних
		|		ПО СписокФизлиц.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
		|		ПО СписокФизлиц.ФизЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ДомашниеТелефоны
		|		ПО СписокФизлиц.ФизЛицо = ДомашниеТелефоны.Объект
		|			И (ДомашниеТелефоны.Вид = &ВидТелефонаДомашний)
		|			И (ДомашниеТелефоны.Тип = &ТипТелефон)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаФактические
		|		ПО СписокФизлиц.ФизЛицо = АдресаФактические.Объект
		|			И (АдресаФактические.Вид = &ВидАдресаФактический)
		|			И (АдресаФактические.Тип = &ТипАдрес)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаРегистрации
		|		ПО СписокФизлиц.ФизЛицо = АдресаРегистрации.Объект
		|			И (АдресаРегистрации.Вид = &ВидАдресаРегистрации)
		|			И (АдресаФактические.Тип = &ТипАдрес)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СписокФизлиц.Сортировка,
		|	Период,
		|	Фамилия";
		
	КонецЕсли;
	//Аверсон-софт, Островская Татьяна 20.06.2012 № 15516
	
	ТаблицаРаботникиОрганизации = Новый таблицаЗначений();
	ДопРаботникиОрганизации = Новый Массив;
	
	ТаблицаРаботникиОрганизации = (Запрос.Выполнить().Выгрузить());
	
	РаботникиОрганизации.Загрузить(Запрос.Выполнить().Выгрузить());
	ДатаНачала = НачалоКвартала(ДатаРегистрации);
	ДатаОкончания = КонецКвартала(ДатаРегистрации);
	Для каждого СтрокаТЧ из РаботникиОрганизации цикл
		
		мДобавлено = Ложь;
		Если ТипЗнч(СтрокаТЧ.Документ) = Тип("ДокументСсылка.ДоговорНаВыполнениеРаботСФизЛицом") тогда
			Если (СтрокаТЧ.Документ.Датаначала < ДатаНачала) ИЛИ (СтрокаТЧ.Документ.ДатаОкончания<= ДатаНачала) тогда
				СтрокаТЧ.ДатаПриема     = "";
				СтрокаТЧ.ДатаУвольнения = "";
				ДопработникиОрганизации.Добавить(СтрокаТЧ);
			Иначе
				СтрокаТЧ.ДатаПриема     = СтрокаТЧ.Документ.Датаначала;
				СтрокаТЧ.ДатаУвольнения = СтрокаТЧ.Документ.Датаокончания;
			КонецЕсли;
		ИначеЕсли ТипЗнч(СтрокаТЧ.Документ) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") тогда
			ДокументОснование = СтрокаТЧ.Документ.ПолучитьОбъект();
			СтрокаДаты = ДокументОснование.РаботникиОрганизации.НайтиСтроки(Новый Структура("ФизЛицо",СтрокаТЧ.ФизЛицо));
			//толик            
			Если СтрокаДаты.Количество() <> 0 тогда
				СтрокаТЧ.ДатаПриема = СтрокаДаты[0].ДатаПриема;
			Иначе
				ДопработникиОрганизации.Добавить(СтрокаТЧ);
			КонецЕсли;
		ИначеЕсли ТипЗнч(СтрокаТЧ.Документ) = Тип("ДокументСсылка.УвольнениеИзОрганизаций") тогда
			ДокументОснование = СтрокаТЧ.Документ.ПолучитьОбъект();
			СтрокаДаты = ДокументОснование.РаботникиОрганизации.НайтиСтроки(Новый Структура("ФизЛицо",СтрокаТЧ.ФизЛицо));
			//толик 
			Если СтрокаДаты.Количество() <> 0 Тогда
				СтрокаРаботника = РаботникиОрганизации.НайтиСтроки(Новый Структура("ФизЛицо, ДатаУвольнения", СтрокаТЧ.ФизЛицо, '00010101000000'));
				Если СтрокаРаботника.Количество() > 1 Тогда
					Если ЗначениеЗаполнено(СтрокаРаботника[0].ДатаПриема) И СтрокаРаботника[0].ДатаПриема < СтрокаДаты[0].ДатаУвольнения Тогда
						Если СтрокаРаботника[0] <> СтрокаТЧ Тогда
							СтрокаРаботника[0].ДатаУвольнения = СтрокаДаты[0].ДатаУвольнения;
							ДопРаботникиОрганизации.Добавить(СтрокаТЧ);
						Иначе
							СтрокаТЧ.ДатаУвольнения = СтрокаДаты[0].ДатаУвольнения;
							ДопРаботникиОрганизации.Добавить(СтрокаРаботника[0]);
						КонецЕсли;
					Иначе
						СтрокаТЧ.ДатаУвольнения = СтрокаДаты[0].ДатаУвольнения;
					КонецЕсли;
				Иначе
					СтрокаТЧ.ДатаУвольнения = СтрокаДаты[0].ДатаУвольнения;
				КонецЕсли;
			Иначе
				ОбщегоНазначения.СообщитьОбОшибке(Строка(ДокументОснование));    
			КонецЕсли;
		КонецЕсли;
		
	Конеццикла;
	
	Для Каждого Стр из ДопРаботникиОрганизации цикл
		РаботникиОрганизации.Удалить(Стр);
	КонецЦикла;
	
КонецФункции

#Если Клиент Тогда

// Формирует файл, который можно будет записать на дискетку
//
// Параметры: 
//  Нет
//
// Возвращаемое значение:
//  Строка - содержимое файла
//

Функция СформироватьВыходнойФайл(Отказ) Экспорт

    // Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	Если ВыборкаПоШапкеДокумента.Следующий()=0 тогда
		Отказ = Истина;
		Возврат "";
	КонецЕсли;    
	
	ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
	Если Отказ тогда
		Возврат "";
	КонецЕсли;     
	
	Результат                    =    СформироватьЗапросПоРаботникиОрганизации();
	ВыборкаПоРаботникиОрганизации            =    Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Если ВыборкаПоРаботникиОрганизации.Количество()>200 тогда
		ОбщегоНазначения.СообщитьОбОшибке("В документе должно быть не более 200 анкет (работников)!", Отказ, Заголовок);
	КонецЕсли;     
	
	СписокОбработанныхАнкет = Новый СписокЗначений;
	
	ТекстФайла    =    "";
	НомерДокументаВПачке = 0;
	
	//Формируем заголовок выходного файла
	ДатаФормирования = ВыборкаПоШапкеДокумента.Дата;
	ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
	МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
	ГодШапки          = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
	ДатаЗаполнения   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
	НомерПачки                 = ПроцедурыПерсонифицированогоУчета.НомерПачкиДокумента(ВыборкаПоШапкеДокумента.Номер);
	КоличествоДокументов     = ВыборкаПоРаботникиОрганизации.Количество();
	
	Если Отказ тогда
		Возврат "";
	КонецЕсли;   
	//Аверсон-софт, Островская Татьяна 20.06.2012 № 15
	ЗапросТел = Новый Запрос;
	ЗапросТел.Текст = 
	 "ВЫБРАТЬ
	 |	КонтактнаяИнформация.Тип,
	 |	КонтактнаяИнформация.Вид,
	 |	КонтактнаяИнформация.Объект,
	 |	КонтактнаяИнформация.Поле3
	 |ИЗ
	 |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	 |ГДЕ
	 |	КонтактнаяИнформация.Объект = &Объект
	 |	И КонтактнаяИнформация.Тип = &Тип
	 |	И КонтактнаяИнформация.Вид = &Вид";
	 ЗапросТел.УстановитьПараметр("Объект",ВыборкаПоШапкеДокумента.Организация);
	 ЗапросТел.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);
	 ЗапросТел.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
	 Рез = ЗапросТел.Выполнить().Выбрать();
	 ТелефонОрг = "";
	 пока Рез.Следующий() цикл
		 ТелефонОрг = Рез.Поле3;
	 КонецЦикла;
	 Квартал = "";
	 если Месяц(ВыборкаПоШапкеДокумента.Ссылка.ДатаРегистрации) < 4 тогда 
		 Квартал = "1";
	 ИначеЕсли Месяц(ВыборкаПоШапкеДокумента.Ссылка.ДатаРегистрации) > 3 и Месяц(ВыборкаПоШапкеДокумента.Ссылка.ДатаРегистрации) < 7 тогда
		 Квартал = "2";
	 ИначеЕсли Месяц(ВыборкаПоШапкеДокумента.Ссылка.ДатаРегистрации) > 6 и Месяц(ВыборкаПоШапкеДокумента.Ссылка.ДатаРегистрации) < 10 тогда
		 Квартал = "3";
	 ИначеЕсли Месяц(ВыборкаПоШапкеДокумента.Ссылка.ДатаРегистрации) > 9  тогда
		 Квартал = "4";
	 КонецЕсли;
	//Аверсон-софт, Островская Татьяна 20.06.2012 № 15
	
	ТекстФайла = Новый ТекстовыйДокумент;
	текстФайла.ДобавитьСтроку("ЗГЛВ=1.5=");//Островская Татьяна 17.01.2013 № 16153
	ТекстФайла.ДобавитьСтроку(Врег("<ПАЧК="+СокрЛП(ВыборкаПоШапкеДокумента.Организация.ИНН)+"="+СокрЛП(ВыборкаПоШапкеДокумента.Организация.РегистрационныйНомерПФР)+
	"="+СокрЛП(ВыборкаПоШапкедокумента.организация.НаименованиеПолное)+"="+Число(ВыборкаПоШапкеДокумента.Номер)+"= = =1="));
	ТекстФайла.ДобавитьСтроку("ТИПД=ПУ-2="+КоличествоДокументов+"= = = = =>");//Островская Татьяна 17.01.2013 № 16153
	//Аверсон-софт, Островская Татьяна 20.06.2012 № 15516
	Если Не ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Дата) тогда
			ДеньШапки = " ";
			МесяцШапки = "";
			ГодШапки = "";
			ДатаДокумента = ДеньШапки;
		Иначе
			ДеньШапки        = ?(День(ВыборкаПоШапкеДокумента.Дата)<10,"0","")+День(ДатаФормирования);
			МесяцШапки       =?(Месяц(ВыборкаПоШапкеДокумента.Дата)<10,"0","")+Месяц(ДатаФормирования);
			ГодШапки          = Строка(СокрЛП(Формат(Год(ВыборкаПоШапкеДокумента.Дата), "ЧГ=0")));
			ДатаДокумента = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
		Конецесли;
	ТекстФайла.ДобавитьСтроку("<ПУ-2=И="+СокрЛП(ВыборкаПоШапкеДокумента.Организация.РегистрационныйНомерПФР)+"= = ="+СокрЛП(Строка(КоличествоДокументов))+"="+?(ЗначениеЗаполнено(ТелефонОрг),ТелефонОрг," ")+"="+ДатаДокумента+"="+Квартал+"="+СтрЗаменить(Год(ВыборкаПоШапкеДокумента.Ссылка.ДатаРегистрации)," ","")+"=");
	//Аверсон-софт, Островская Татьяна 20.06.2012 № 15516
	ТипЗаписи = "ДВИЖ=";
	
	Пока ВыборкаПоРаботникиОрганизации.Следующий()    Цикл
		//Контроль дубля строк
		Если СписокОбработанныхАнкет.НайтиПоЗначению(ВыборкаПоРаботникиОрганизации.ФизЛицо) = Неопределено тогда
			СписокОбработанныхАнкет.Добавить(ВыборкаПоРаботникиОрганизации.ФизЛицо);
		Иначе    
			ОбщегоНазначения.СообщитьОбОшибке("Строка №"+ВыборкаПоРаботникиОрганизации.НомерСтроки+": Работник "+ВыборкаПоРаботникиОрганизации.ФизЛицо+ " указан(а) в документе дважды!");
		КонецЕсли;     
		
		СтрокаФайла = ТипЗаписи;
		//Инициалы должны быть указаны
		Фамилия = ?(ВыборкаПоРаботникиОрганизации.Фамилия = "", " ", СокрЛП(ВыборкаПоРаботникиОрганизации.Фамилия));
		//толик полные И О
		//Аверсон-софт, Островская Татьяна 20.06.2012 № 15516
		Имя = Лев(?(ВыборкаПоРаботникиОрганизации.Имя = "", " ", СокрЛП(ВыборкаПоРаботникиОрганизации.Имя)),1);
		Отчество = Лев(?(ВыборкаПоРаботникиОрганизации.Отчество = "", " ", СокрЛП(ВыборкаПоРаботникиОрганизации.Отчество)),1);
		//Аверсон-софт, Островская Татьяна 20.06.2012 № 15516
		//
		//Имя = ?(ВыборкаПоРаботникиОрганизации.Имя = "", " ", Лев(СокрЛП(ВыборкаПоРаботникиОрганизации.Имя),1));
		//Отчество = ?(ВыборкаПоРаботникиОрганизации.Отчество = "", " ", Лев(СокрЛП(ВыборкаПоРаботникиОрганизации.Отчество),1));
		СтрокаФайла = СтрокаФайла+Фамилия+"="+Имя+"="+Отчество+"=";
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		НомерДокументаВПачке =     НомерДокументаВПачке + 1;
		
		//Берем запись с пустыми полями
		//Запись = ПолучитьСтруктуруЗаписи(ТаблицаФорматаЗаписи);
		
		НомерДокументаВПачке = НомерДокументаВПачке;
		ДатаЗаполнения = ДатаЗаполнения;
		
		ДатаФормирования = ВыборкаПоРаботникиОрганизации.ДатаПриема;
		Если Не ЗначениеЗаполнено(ДатаФормирования) тогда
			ДеньШапки = " ";
			МесяцШапки = "";
			ГодШапки = "";
			ДатаПриема = ДеньШапки;
		Иначе
			ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
			МесяцШапки       =?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
			ГодШапки          = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
			ДатаПриема = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
		Конецесли;

		
		
		ДатаФормирования = ВыборкаПоРаботникиОрганизации.ДатаУвольнения;
		
		Если Не ЗначениеЗаполнено(ДатаФормирования) тогда
			ДеньШапки = " ";
			МесяцШапки = "";
			ГодШапки = "";
			ДатаУвольнения = ДеньШапки;
		Иначе
			ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
			МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
			ГодШапки          = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
			ДатаУвольнения = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
		Конецесли;
		//Аверсон-софт, Островская Татьяна 20.06.2012 № 15516
			//Островская Татьяна 31.10.2012 № 15
			если Строка(типзнч(ВыборкаПоРаботникиОрганизации.Документ)) = "Договор на выполнение работ с физ. лицом" тогда
				КодДоговора = "03";
			иначе
				КодДоговора = "01";
			КонецЕсли;
			если Год(ВыборкаПоШапкеДокумента.Ссылка.ДатаРегистрации)>= 2012 и КодДоговора = "01" тогда 
				КодДоговора = " ";
			КонецЕсли;
			
			//О.Т. Аверсон 24.01.2018 № 1494
			если ДатаРегистрации >= Дата(2018,1,1) и ВыборкаПоРаботникиОрганизации.ВнешнееСовместительство Тогда 
				СтрокаФайла = СтрокаФайла + ВыборкаПоРаботникиОрганизации.ЛичныйНомер+"="+ДатаПриема+"="+КодДоговора+"="+датаУвольнения+?(СокрЛП(датаУвольнения)="","=1= =","= = =");
			иначе
				СтрокаФайла = СтрокаФайла + ВыборкаПоРаботникиОрганизации.ЛичныйНомер+"="+ДатаПриема+"="+КодДоговора+"="+датаУвольнения+"= = =";
			КонецЕсли;
			//О.Т. Аверсон 24.01.2018 № 1494
			
			//Аверсон-софт, Островская Татьяна 20.06.2012 № 15516
			Если НомерДокументаВПачке = КоличествоДокументов тогда
				СтрокаФайла = СтрокаФайла + ">";
		КонецЕсли;
		ТекстФайла.ДобавитьСтроку(СтрокаФайла);
	КонецЦикла; 
	
	//О.Т. Аверсон 27.06.2016 № 1278
	ПутьКФайлу = РегистрыСведений.УчетнаяПолитикаПоПерсоналуОрганизаций.Получить(Новый Структура("Организация",Организация)).ПутьДляВыгрузкиПУ12;
		
	//+ СВЭЙ КДЯ 21.09.19 СВФР-004805
	ИмяФайлаПачки = ПроцедурыПерсонифицированогоУчета.ПолучитьИмяФайлаФормыПУ( 2, 
		1, ДатаРегистрации, Организация );
	//- СВЭЙ КДЯ 21.09.19 СВФР-004805 
		
	если ЗначениеЗаполнено(ПутьКФайлу) Тогда 
		Попытка //О.Т. Аверсон 11.07.2017 № 806 		
			//+ СВЭЙ КДЯ 21.09.19 СВФР-004805
			//ТекстФайла.Записать(ПутьКФайлу+"\"+Номер+".txt",КодировкаТекста.ANSI);
			//Сообщить("Файл сохранен: " + ПутьКФайлу+"\"+Номер+".txt");      		
			//- СВЭЙ КДЯ 21.09.19 СВФР-004805 
			//+ СВЭЙ КДЯ 21.09.19 СВФР-004805
			ТекстФайла.Записать( ПутьКФайлу + "\" + ИмяФайлаПачки, КодировкаТекста.ANSI );
			Сообщить( "Файл сохранен: " + ПутьКФайлу + "\" + ИмяФайлаПачки );
			//- СВЭЙ КДЯ 21.09.19 СВФР-004805 
		Исключение
			Сообщить("Неверный путь! Файл не выгружен.");
		КонецПопытки;
	иначе
		РабочийКаталог = СтрокаСоединенияИнформационнойБазы();
		б = Сред(РабочийКаталог,7);
		в = Найти(б,Символ(34));
		путьИБ = Лев(б, в-1);
		//+ СВЭЙ КДЯ 21.09.19 СВФР-004805
		//ТекстФайла.Записать(путьИБ+"\"+Номер+".txt",КодировкаТекста.ANSI);
		//Сообщить("Файл сохранен: " + путьИБ+"\"+Номер+".txt");
		//- СВЭЙ КДЯ 21.09.19 СВФР-004805 
		//+ СВЭЙ КДЯ 21.09.19 СВФР-004805
		ТекстФайла.Записать( путьИБ + "\" + ИмяФайлаПачки, КодировкаТекста.ANSI );
		Сообщить( "Файл сохранен: " + путьИБ + "\" + ИмяФайлаПачки );
		//- СВЭЙ КДЯ 21.09.19 СВФР-004805 
	КонецЕсли;
	//О.Т. Аверсон 27.06.2016 № 1278

	
	Возврат ТекстФайла; //О.Т. Аверсон 27.06.2016 № 1278 //ПолучитьТекст()
КонецФункции 

//Процедура вывода файла сведений на печать
Процедура ПечатьФайла(РежимПечати = 0, МестоВызова = "") Экспорт

	ЕстьОшибки = Ложь;
	ТекстФайла = РегламентированнаяОтчетность.ПолучитьТекстФайла(ЭтотОбъект,ЕстьОшибки);
	Если ЕстьОшибки тогда
		Возврат;
	КонецЕсли;	 

	Макет = ПолучитьМакет("ФормаАДВ_1");
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АнкетаЗастрахованногоЛица_ФормаАДВ_1";

	//Получаем таблицу формата записи
	ДокументФорматЗаписей = ПолучитьМакет("ФорматЗаписей");
	ТаблицаФорматаЗаписи = РегламентированнаяОтчетность.ПолучитьФорматЗаписи("АНКТ",ДокументФорматЗаписей);

	//Получаем инициализированную структуру, соответствующую формату записи 
	//ПустаяЗапись = ПолучитьСтруктуруЗаписи(ТаблицаФорматаЗаписи);
	
	//Обработка заголовка файла
	ИнформацияОПачке = Новый Структура;
	Если ПроцедурыПерсонифицированогоУчета.РазобратьЗаголовокФайла(ТекстФайла,ИнформацияОПачке)=0 тогда
		Возврат;
	КонецЕсли;	
	
	//Обработка документов файла
	ОбластьАнкета = Макет.ПолучитьОбласть("Анкета");
    
	Для Н=5 по СтрЧислоСтрок(ТекстФайла) цикл
		//Прочитаем запись из файла
		СтрокаФайла = СтрПолучитьСтроку(ТекстФайла,Н);
		Запись = ПроцедурыПерсонифицированогоУчета.ПолучитьСтруктуруЗаписи(ТаблицаФорматаЗаписи);
		СтрОшибка = "";
		Если НЕ ПроцедурыПерсонифицированогоУчета.РазложитьСтрокуВСтруктуруЗаписи(СтрокаФайла,"АНКТ",ТаблицаФорматаЗаписи,Запись,СтрОшибка) тогда
			Сообщить("Ошибка в строке файла № "+Н+": "+СтрОшибка);
			Возврат;
		КонецЕсли;	

		ОбластьАнкета.Параметры.ДатаЗаполнения					= 	"Дата заполнения "+ПроцедурыПерсонифицированогоУчета.ДатаВОтчет(Запись.ДатаЗаполнения);
		ОбластьАнкета.Параметры.Фамилия 						= Запись.Фамилия; 
		ОбластьАнкета.Параметры.Имя 							= Запись.Имя; 
		ОбластьАнкета.Параметры.Отчество 						= Запись.Отчество; 
		ОбластьАнкета.Параметры.Пол 							= Запись.Пол+"     (м/ж)"; 
		ОбластьАнкета.Параметры.ДатаРождения 					= ПроцедурыПерсонифицированогоУчета.ДатаВОтчет(Запись.СтандартнаяДатаРождения); 

		//Место рождения
		ОбластьАнкета.Параметры.МестоРожденияТип 				= 	?(Запись.ТипМестаРождения = "ОСОБОЕ", "особое", "");
		ОбластьАнкета.Параметры.МестоРожденияГород 				= 	Запись.МестоРожденияНаселенныйПункт;
		ОбластьАнкета.Параметры.МестоРожденияРайон 				= 	Запись.МестоРожденияРайон;
		ОбластьАнкета.Параметры.МестоРожденияОбласть			= 	Запись.МестоРожденияОбласть;
		ОбластьАнкета.Параметры.МестоРожденияСтрана			 	= 	Запись.МестоРожденияСтрана;

		ОбластьАнкета.Параметры.Гражданство 					= 	Запись.Гражданство;

		//Паспортные данные
		НаименованиеДокумента 									= 	Запись.ДокументНаименование;
		Серия1 													= 	Запись.ДокументСерияРимскиеЦифры;
		Серия2 													= 	Запись.ДокументСерияРусскиеБуквы;
		
		СерияНомер = Серия1 +?( СокрЛП(НаименованиеДокумента) 	= ВРЕГ("паспорт РБ"), " ", ?( СокрЛП(НаименованиеДокумента) = ВРЕГ("паспорт"), "-", "") ) + Серия2 +",  " + Формат(Запись.ДокументНомер,"ЧГ=0");

		ОбластьАнкета.Параметры.НаименованиеДокумента		= 	НаименованиеДокумента;
		ОбластьАнкета.Параметры.СерияНомер			 		= 	СерияНомер;
		ОбластьАнкета.Параметры.ДатаВыдачи 					= 	ПроцедурыПерсонифицированогоУчета.ДатаВОтчет(Запись.ДокументДатаВыдачи);
		ОбластьАнкета.Параметры.КемВыдан 					= 	Запись.ДокументКемВыдан;
		
		//Адреса
		ОбластьАнкета.Параметры.АдресРегистрации 			=	РегламентированнаяОтчетность.ПредставлениеАдреса(Запись.АдресРегистрации,0,"");
		ОбластьАнкета.Параметры.АдресФактический 			= 	РегламентированнаяОтчетность.ПредставлениеАдреса(Запись.АдресФактический,0,"");
		ОбластьАнкета.Параметры.Телефоны 					= 	Запись.Телефоны;
		
		ДокументРезультат.Вывести(ОбластьАнкета);
		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;	
	
	РаботаСДиалогами.НапечататьДокумент(ДокументРезультат,1,Ложь,"Анкета застрахованного лица АДВ-1");

    //Печать описи документов
	ДокументОписи = Новый ТабличныйДокумент;
	ДокументОписи.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АнкетаЗастрахованногоЛица_АДВ_6";
	ОтветственныеЛица = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Организация,Дата,Ответственный.ФизЛицо);
	ПроцедурыПерсонифицированогоУчета.ВывестиОписьАДВ6(ДокументОписи,ИнформацияОПачке,ОтветственныеЛица);
	РаботаСДиалогами.НапечататьДокумент(ДокументОписи,1,Ложь,"Опись документов АДВ-6");
КонецПроцедуры

#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке()

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);

	Запрос.Текст = "
	|Выбрать 
	|	Дата, 
	|	Номер, 
	|	Организация,
	|	Ответственный,
	| 	Ссылка 
	|Из 
	|	Документ." + Метаданные().Имя + "
	|Где 
	|	Ссылка = &ДокументСсылка
	|";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

// Выбирает данные, необходимые для заполнения утвержденных форм как из спр-ка
//  физлиц, так и из соотв. регистров сведений
//
// Параметры: 
//  Нет
//
// Возвращаемое значение:
//  Результат запроса к данным работников документа.
//
Функция	СформироватьЗапросПоРаботникиОрганизации()
	
	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	Запрос.УстановитьПараметр("ДатаАктуальности" , Дата);
	Запрос.УстановитьПараметр("ВидАдресаРегистрации" , Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица);
	Запрос.УстановитьПараметр("ВидАдресаФактический" , Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица);
   	Запрос.УстановитьПараметр("ВидТелефонаДомашний" , Справочники.ВидыКонтактнойИнформации.ТелефонФизЛица);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АнкетаЗастрахованногоЛицаРаботники.НомерСтроки КАК НомерСтроки,
	|	АнкетаЗастрахованногоЛицаРаботники.ФизЛицо КАК ФизЛицо,
	|	АнкетаЗастрахованногоЛицаРаботники.ФизЛицо.Наименование КАК ФизЛицоНаименование,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ЛичныйНомер ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ЛичныйНомер
	|	КОНЕЦ КАК ЛичныйНомер,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ПаспортСерия ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ПаспортСерия
	|	КОНЕЦ КАК ДокументСерия,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ПаспортНомер ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ПаспортНомер
	|	КОНЕЦ КАК ДокументНомер,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ПаспортДатавыдачи ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ПаспортДатавыдачи
	|	КОНЕЦ КАК ДокументДатаВыдачи,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ПаспортКемВыдан ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ПаспортКемВыдан
	|	КОНЕЦ КАК ДокументКемВыдан,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.АдресРегистрации ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.АдресРегистрации
	|	КОНЕЦ КАК АдресРегистрации,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ИндексРегистрации ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ИндексРегистрации
	|	КОНЕЦ КАК ИндексРегистрации,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.Телефоны ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.Телефоны
	|	КОНЕЦ КАК Телефоны,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.Фамилия ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.Фамилия
	|	КОНЕЦ КАК Фамилия,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.Имя ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.Имя
	|	КОНЕЦ КАК Имя,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.Отчество ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.Отчество
	|	КОНЕЦ КАК Отчество,
	|	АнкетаЗастрахованногоЛицаРаботники.Пол,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ДатаПриема ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ДатаПриема
	|	КОНЕЦ КАК ДатаПриема,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ДатаУвольнения ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ДатаУвольнения
	|	КОНЕЦ КАК ДатаУвольнения,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ДатаРождения ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ДатаРождения
	|	КОНЕЦ КАК ДатаРождения,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ГородРождения ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ГородРождения
	|	КОНЕЦ КАК ГородРождения,
	|	АнкетаЗастрахованногоЛицаРаботники.Гражданство.Наименование КАК Страна,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.РайонРождения ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.РайонРождения
	|	КОНЕЦ КАК РайонРождения,
	|	АнкетаЗастрахованногоЛицаРаботники.СтранаРождения,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ОбластьРождения ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ОбластьРождения
	|	КОНЕЦ КАК ОбластьРождения,
	|	АнкетаЗастрахованногоЛицаРаботники.ФизЛицо.СтатусКатегория.КодПФР КАК КодФСЗН,
	|	АнкетаЗастрахованногоЛицаРаботники.Документ,
	|	АнкетаЗастрахованногоЛицаРаботники.ВнешнееСовместительство

	|ИЗ
	|	Документ.СведенияОДвиженииРаботниковДПУ.РаботникиОрганизации КАК АнкетаЗастрахованногоЛицаРаботники
	|ГДЕ
	|	АнкетаЗастрахованногоЛицаРаботники.Ссылка = &ДокументСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	//Островская Татьяна 31.10.2012 № 15
	Возврат Запрос.Выполнить();
	
КонецФункции

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении.
//	Заголовок				- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)

	Если Не ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация, которая подает сведения!", Отказ, Заголовок);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Ответственный) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указано ответственное лицо!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "РаботникиОрганизации" документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса по работникам, 
//  Отказ 						- флаг отказа в проведении.
//	Заголовок				- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Фамилия, Имя, Отказ ,Заголовок)

	СтрокаНачалаСообщенияОбОшибке = "В строке № """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
									""" табл. части ""Работники организации"": ";
	// ФизЛицо
	Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ФизЛицо) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не выбран работник!", Отказ ,Заголовок);
	Иначе	
		СтрокаНачалаСообщенияОбОшибке = СтрокаНачалаСообщенияОбОшибке + ВыборкаПоСтрокамДокумента.ФизЛицо + " ";

		Если  ЗначениеЗаполнено(СтрЗаменить(ВыборкаПоСтрокамДокумента.СтраховойНомерПФР,"-","")) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Уже имеет страховой номер!", Отказ ,Заголовок);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Фамилия) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задана фамилия!", Отказ ,Заголовок);
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(Имя) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задано имя!", Отказ ,Заголовок);
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Пол) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задан пол!", Отказ ,Заголовок);
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаРождения) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задана дата рождения!", Отказ ,Заголовок);
		Иначе
			Если ВыборкаПоСтрокамДокумента.ДатаРождения > Дата тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Дата рождения не может быть больше даты подачи сведений!", Отказ ,Заголовок);
			КонецЕсли;	 
		КонецЕсли;	
		
		Если СокрЛП(СтрЗаменить(ВыборкаПоСтрокамДокумента.МестоРождения,",","")) = "" 
			или СокрЛП(СтрЗаменить(ВыборкаПоСтрокамДокумента.МестоРождения,",","")) = "0" Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не указано место рождения!", Отказ ,Заголовок);
		КонецЕсли; 

		//Паспортные данные
        Если ВыборкаПоСтрокамДокумента.ДокументВид = NULL Тогда

			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не указаны паспортные данные!", Отказ ,Заголовок);

		Иначе

			//Проверка реквизитов паспортных данных
			Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДокументВид) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задан вид документа, удостоверяющего личность!", Отказ ,Заголовок);
			КонецЕсли;	

			Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДокументДатаВыдачи) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задана дата выдачи документа, удостоверяющего личность!", Отказ ,Заголовок);
			Иначе
				Если (ВыборкаПоСтрокамДокумента.ДатаРождения > ВыборкаПоСтрокамДокумента.ДокументДатаВыдачи) Тогда
					ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Дата рождения не должна превышать дату выдачи документа, удостоверяющего личность!", Отказ ,Заголовок);
				КонецЕсли;
			КонецЕсли;	

			Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДокументСерия) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задана серия документа, удостоверяющего личность!", Отказ ,Заголовок);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДокументНомер) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задан номер документа, удостоверяющего личность!", Отказ ,Заголовок);
			КонецЕсли;
		КонецЕсли; 

		// Проверка адреса регистрации и проживания
		Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.АдресРегистрации) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задан адрес регистрации (юридический адрес)!", Отказ ,Заголовок);
		КонецЕсли;	
		Если НЕ РегламентированнаяОтчетность.АдресСоответствуетТребованиям(РегламентированнаяОтчетность.РазложитьАдрес(ВыборкаПоСтрокамДокумента.АдресРегистрации)) тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- В адресе регистрации присутствуют латинские или недопустимые символы!", Отказ ,Заголовок);
		КонецЕсли;
		Если НЕ РегламентированнаяОтчетность.АдресСоответствуетТребованиям(РегламентированнаяОтчетность.РазложитьАдрес(ВыборкаПоСтрокамДокумента.АдресФактический)) тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- В фактическом адресе проживания присутствуют латинские или недопустимые символы!", Отказ ,Заголовок);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизации()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	//При проведении файл формируем заново 
	ТекстФайла = "";
	#Если Клиент Тогда
	ТекстФайла = СформироватьВыходнойФайл(Отказ);
	#КонецЕсли
	//Если Отказ тогда
	//	Возврат;
	//КонецЕсли;	 

	//Сохраним сформированный файл сведений в регистре сведений
	Если не Отказ Тогда 
		Запись = Движения["АрхивДанныхРегламентированнойОтчетности"].Добавить();
		Запись.Объект = Ссылка;
		Запись.ОписаниеДанных = "Файл-пачка форм ПУ-2";
		Запись.Данные = ТекстФайла; 
	КонецЕсли;
КонецПроцедуры	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации,,"ФизЛицо");

	
КонецПроцедуры
